kouryaku-rails/app/controllers/bookmarks_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."game_id" = ? ORDER BY "bookmarks"."created_at" DESC  [["game_id", 4]]
---
	def index
		@game = Game.find(params[:game_id])
		@bookmarks = @game.bookmarks.order(created_at: :desc)

INSERT INTO "bookmarks" ("game_id", "bookmark_name", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["game_id", 3], ["bookmark_name", "jpp"], ["url", "zim"], ["created_at", "2020-11-12 05:23:54.909780"], ["updated_at", "2020-11-12 05:23:54.909780"]]
---
	def create
		bookmark = Bookmark.new(post_params)
		if bookmark.save

UPDATE "bookmarks" SET "bookmark_name" = ?, "updated_at" = ? WHERE "bookmarks"."id" = ?  [["bookmark_name", "森の神殿"], ["updated_at", "2020-11-13 02:08:21.212033"], ["id", 29]]
---
	def update
		if @bookmark.update(post_params)