kouryaku-rails/app/controllers/games_controller.rb

	def index
		@user = User.find(params[:user_id])
		@games = @user.games.order(created_at: :desc)
---
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."user_id" = ? ORDER BY "games"."created_at" DESC  [["user_id", 1]]

	def create
		game = Game.new(post_params)
		if game.save
---
INSERT INTO "games" ("user_id", "game_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["game_name", "ポケモンGO"], ["created_at", "2020-11-11 01:23:04.536728"], ["updated_at", "2020-11-11 01:23:04.536728"]]

	def update
		if @game.update(post_params)
---
UPDATE "games" SET "game_name" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["game_name", "ポケモン　ルビー"], ["updated_at", "2020-11-11 02:00:53.665102"], ["id", 3]]

	def destroy
		# ゲームIDに合致するブックマークを全て削除する
		Bookmark.where(game_id: params[:id]).destroy_all
---
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]